#### [infrastructure/][prod] Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```

terraform
module.ui.azurerm_app_service.this: Refreshing state... [id=/subscriptions/ca70c44c-ad7a-4333-a22c-07ebc6a69224/resourceGroups/time-tracker-service-prod/providers/Microsoft.Web/sites/time-tracker-service-prod-ui]
module.ui.azurerm_dns_cname_record.this: Refreshing state... [id=/subscriptions/ca70c44c-ad7a-4333-a22c-07ebc6a69224/resourceGroups/time-tracker-service-prod/providers/Microsoft.Network/dnszones/timetrackerapp.ioet.com/CNAME/ui]
module.ui.azurerm_app_service_custom_hostname_binding.this: Refreshing state... [id=/subscriptions/ca70c44c-ad7a-4333-a22c-07ebc6a69224/resourceGroups/time-tracker-service-prod/providers/Microsoft.Web/sites/time-tracker-service-prod-ui/hostNameBindings/ui.timetrackerapp.ioet.com]
module.ui.azurerm_dns_txt_record.this: Refreshing state... [id=/subscriptions/ca70c44c-ad7a-4333-a22c-07ebc6a69224/resourceGroups/time-tracker-service-prod/providers/Microsoft.Network/dnszones/timetrackerapp.ioet.com/TXT/asuid.ui.timetrackerapp.ioet.com]
module.ui.azurerm_app_service_managed_certificate.this: Refreshing state... [id=/subscriptions/ca70c44c-ad7a-4333-a22c-07ebc6a69224/resourceGroups/time-tracker-service-prod/providers/Microsoft.Web/certificates/ui.timetrackerapp.ioet.com]
module.ui.azurerm_app_service_certificate_binding.this: Refreshing state... [id=/subscriptions/ca70c44c-ad7a-4333-a22c-07ebc6a69224/resourceGroups/time-tracker-service-prod/providers/Microsoft.Web/sites/time-tracker-service-prod-ui/hostNameBindings/ui.timetrackerapp.ioet.com|/subscriptions/ca70c44c-ad7a-4333-a22c-07ebc6a69224/resourceGroups/time-tracker-service-prod/providers/Microsoft.Web/certificates/ui.timetrackerapp.ioet.com]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.ui.azurerm_app_service_certificate_binding.this has changed
  ~ resource "azurerm_app_service_certificate_binding" "this" {
        id                  = "/subscriptions/ca70c44c-ad7a-4333-a22c-07ebc6a69224/resourceGroups/time-tracker-service-prod/providers/Microsoft.Web/sites/time-tracker-service-prod-ui/hostNameBindings/ui.timetrackerapp.ioet.com|/subscriptions/ca70c44c-ad7a-4333-a22c-07ebc6a69224/resourceGroups/time-tracker-service-prod/providers/Microsoft.Web/certificates/ui.timetrackerapp.ioet.com"
      ~ thumbprint          = "1EB16A439CB36538644BF7072F553E2876B72872" -> "F02EECF769BF5DA7023A35DED6B8430F236FD7C7"
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ui.azurerm_app_service_custom_hostname_binding.this has changed
  ~ resource "azurerm_app_service_custom_hostname_binding" "this" {
        id                  = "/subscriptions/ca70c44c-ad7a-4333-a22c-07ebc6a69224/resourceGroups/time-tracker-service-prod/providers/Microsoft.Web/sites/time-tracker-service-prod-ui/hostNameBindings/ui.timetrackerapp.ioet.com"
      ~ thumbprint          = "1EB16A439CB36538644BF7072F553E2876B72872" -> "F02EECF769BF5DA7023A35DED6B8430F236FD7C7"
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ui.azurerm_app_service_managed_certificate.this has changed
  ~ resource "azurerm_app_service_managed_certificate" "this" {
      ~ expiration_date = "2023-03-23T23:59:59Z" -> "2023-08-07T23:59:59Z"
        id              = "/subscriptions/ca70c44c-ad7a-4333-a22c-07ebc6a69224/resourceGroups/time-tracker-service-prod/providers/Microsoft.Web/certificates/ui.timetrackerapp.ioet.com"
      ~ issue_date      = "2022-09-23T00:00:00Z" -> "2023-02-07T00:00:00Z"
        tags            = {}
      ~ thumbprint      = "1EB16A439CB36538644BF7072F553E2876B72872" -> "F02EECF769BF5DA7023A35DED6B8430F236FD7C7"
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ui.azurerm_app_service.this will be updated in-place
  ~ resource "azurerm_app_service" "this" {
      ~ app_settings                      = {
          # Warning: this attribute value will be marked as sensitive and will not
          # display in UI output after applying this change. The value is unchanged.
          ~ "DOCKER_REGISTRY_SERVER_PASSWORD" = (sensitive)
          # Warning: this attribute value will be marked as sensitive and will not
          # display in UI output after applying this change. The value is unchanged.
          ~ "DOCKER_REGISTRY_SERVER_URL"      = (sensitive)
          # Warning: this attribute value will be marked as sensitive and will not
          # display in UI output after applying this change. The value is unchanged.
          ~ "DOCKER_REGISTRY_SERVER_USERNAME" = (sensitive)
        }
      ~ https_only                        = true -> false
        id                                = "/subscriptions/ca70c44c-ad7a-4333-a22c-07ebc6a69224/resourceGroups/time-tracker-service-prod/providers/Microsoft.Web/sites/time-tracker-service-prod-ui"
        name                              = "time-tracker-service-prod-ui"
        tags                              = {}
        # (15 unchanged attributes hidden)



      ~ site_config {
          + acr_user_managed_identity_client_id  = ""
          + app_command_line                     = ""
          + auto_swap_slot_name                  = ""
          + health_check_path                    = ""
          + java_container                       = ""
          + java_container_version               = ""
          + java_version                         = ""
          # Warning: this attribute value will be marked as sensitive and will not
          # display in UI output after applying this change.
          ~ linux_fx_version                     = (sensitive)
          + php_version                          = ""
          + python_version                       = ""
          + windows_fx_version                   = ""
            # (19 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }


        # (4 unchanged blocks hidden)
    }

  # module.ui.azurerm_app_service_certificate_binding.this must be replaced
-/+ resource "azurerm_app_service_certificate_binding" "this" {
      ~ app_service_name    = "time-tracker-service-prod-ui" -> (known after apply)
      ~ certificate_id      = "/subscriptions/ca70c44c-ad7a-4333-a22c-07ebc6a69224/resourceGroups/time-tracker-service-prod/providers/Microsoft.Web/certificates/ui.timetrackerapp.ioet.com" -> (known after apply) # forces replacement
      ~ hostname            = "ui.timetrackerapp.ioet.com" -> (known after apply)
      ~ id                  = "/subscriptions/ca70c44c-ad7a-4333-a22c-07ebc6a69224/resourceGroups/time-tracker-service-prod/providers/Microsoft.Web/sites/time-tracker-service-prod-ui/hostNameBindings/ui.timetrackerapp.ioet.com|/subscriptions/ca70c44c-ad7a-4333-a22c-07ebc6a69224/resourceGroups/time-tracker-service-prod/providers/Microsoft.Web/certificates/ui.timetrackerapp.ioet.com" -> (known after apply)
      ~ thumbprint          = "F02EECF769BF5DA7023A35DED6B8430F236FD7C7" -> (known after apply)
        # (2 unchanged attributes hidden)

      - timeouts {}
    }

  # module.ui.azurerm_app_service_managed_certificate.this must be replaced
-/+ resource "azurerm_app_service_managed_certificate" "this" {
      ~ canonical_name             = "ui.timetrackerapp.ioet.com" -> (known after apply)
      + custom_hostname_binding_id = "/subscriptions/ca70c44c-ad7a-4333-a22c-07ebc6a69224/resourceGroups/time-tracker-service-prod/providers/Microsoft.Web/sites/time-tracker-service-prod-ui/hostNameBindings/ui.timetrackerapp.ioet.com" # forces replacement
      ~ expiration_date            = "2023-08-07T23:59:59Z" -> (known after apply)
      + friendly_name              = (known after apply)
      ~ host_names                 = [
          - "ui.timetrackerapp.ioet.com",
        ] -> (known after apply)
      ~ id                         = "/subscriptions/ca70c44c-ad7a-4333-a22c-07ebc6a69224/resourceGroups/time-tracker-service-prod/providers/Microsoft.Web/certificates/ui.timetrackerapp.ioet.com" -> (known after apply)
      ~ issue_date                 = "2023-02-07T00:00:00Z" -> (known after apply)
      ~ issuer                     = "GeoTrust Global TLS RSA4096 SHA256 2022 CA1" -> (known after apply)
      ~ subject_name               = "ui.timetrackerapp.ioet.com" -> (known after apply)
      - tags                       = {} -> null
      ~ thumbprint                 = "F02EECF769BF5DA7023A35DED6B8430F236FD7C7" -> (known after apply)

      - timeouts {}
    }

Plan: 2 to add, 1 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pusher: @nicolsss, Action: `pull_request`*